cases/10x7e/RPM_5000/kOmegaSStUnsteady/system/createNonConformalCouples
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createNonConformalCouplesDict;
}

couples
(
    {
        patch1 innerCylinder;
        patch2 innerCylinder_slave;
        // optional: transforms etc (leave out for none)
    }
);
